{
    "Intro": {
      "Spanish": "¡Nueva Yol!",
      "English": "New York!",
      "Explanation": "The introduction sets the stage for the song, with a shout-out to New York City in a colloquial manner."
    },
    "Chorus": {
      "Lyrics": {
        "Spanish": "Si te quieres divertir\nCon encanto y con primor\nSolo tienes que vivir (¿Pa' dónde?)\nUn verano en Nueva York (¡Nueva York!)",
        "English": "If you want to have fun\nWith charm and delight\nYou just have to live (Where to?)\nA summer in New York (New York!)"
      },
      "Explanation": "The chorus describes the enchanting and exciting experience of spending a summer in New York. Bad Bunny's playful interruptions add humor and highlight the city's unpredictable nature."
    },
    "Verse 1": {
      "Lines": [
        {
          "Spanish": "Ey, ey, ey, 4 de julio, 4th de July\nAndo con mi primo, borracho, rulay\nLos mío' en El Bronx saben la que hay\nCon la nota en high por Washington Heights",
          "English": "Hey, hey, hey, 4th of July, 4th of July\nI'm hanging with my cousin, drunk, chill\nMy people in The Bronx know what's up\nWith the vibe high in Washington Heights"
        },
        {
          "Explanation": "Bad Bunny sets the scene of celebrating the 4th of July in New York, highlighting the festive and relaxed atmosphere in Latino neighborhoods like The Bronx and Washington Heights."
        },
        {
          "Spanish": "Willie Colón, me dicen 'el malo', ey\nPorque pasan los año' y sigo dando palo'\nVendiendo disco' como cuadro' 'e Frida Kahlo",
          "English": "Willie Colón, they call me 'the bad one,' hey\nBecause the years go by and I keep making hits\nSelling records like Frida Kahlo's paintings"
        },
        {
          "Explanation": "Referencing Willie Colón and Frida Kahlo, Bad Bunny highlights his continued success and cultural impact in music."
        },
        {
          "Spanish": "El perico es blanco, sí, sí, el tusi rosita, eh, eh\nNo te confunda', no, no, mejor evita, ey (Ey)",
          "English": "The coke is white, yes, yes, the tusi is pink, eh, eh\nDon’t get confused, no, no, better avoid it, hey (Hey)"
        },
        {
          "Explanation": "References to drugs suggest a gritty aspect of nightlife, with a warning to avoid confusion and trouble."
        }
      ]
    },
    "Interlude": {
      "Spanish": "The best in the world\nNumber one, the best in the world, ¿okey? ¡Puerto Rico!",
      "English": "The best in the world\nNumber one, the best in the world, okay? Puerto Rico!",
      "Explanation": "Bad Bunny asserts his global success, highlighting his pride in representing Puerto Rico."
    },
    "Verse 2": {
      "Lines": [
        {
          "Spanish": "¿Cómo Bad Bunny va a ser rey del pop, ey\nCon reggaetón y dembow?",
          "English": "How is Bad Bunny going to be king of pop, hey\nWith reggaetón and dembow?"
        },
        {
          "Explanation": "Bad Bunny challenges traditional music boundaries, embracing his role in mainstream pop while rooted in reggaetón and dembow."
        },
        {
          "Spanish": "Con silenciador les robamo' las gata', James Bond, ey\nYo estoy en la mía, no tengo adversario, no",
          "English": "With silencers we steal their girls, James Bond, hey\nI’m in my zone, I have no adversary, no"
        },
        {
          "Explanation": "Using the imagery of James Bond, he conveys stealth and charm, emphasizing his self-assured position in the music industry."
        }
      ]
    },
    "Second Chorus": {
      "Explanation": "The chorus revisits the vibrant summer theme, with Bad Bunny humorously suggesting the fleeting nature of the moment."
    },
    "Interlude 2": {
      "Spanish": "Shh, cuida'o, que nadie nos escuche",
      "English": "Shh, careful, so no one hears us",
      "Explanation": "Introducing an element of secrecy or exclusivity, this adds intrigue to the song."
    },
    "Verse 3": {
      "Lines": [
        {
          "Spanish": "Tú tiene' piquete, mami, yo también\nTú estás buena, yo estoy bueno también\nHuelo rico y ando con los de cien\nSi tú lo quiere', lo tiene' que mover",
          "English": "You’ve got swagger, baby, so do I\nYou look good, I look good too\nI smell nice and roll with hundred-dollar bills\nIf you want it, you’ve got to move it"
        },
        {
          "Explanation": "Bad Bunny talks about mutual attraction and confidence, along with a call to dance and engage actively with the vibe."
        }
      ]
    },
    "Outro": {
      "Explanation": "The outro repeats the call to 'move,' emphasizing a rhythmic and energetic conclusion to the song."
    }
  }